Examples/FSI_Mok/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application         pimpleFoam;

startFrom           startTime;
//startFrom           latestTime;

startTime           0;

stopAt              endTime;

endTime             25.0;

deltaT              0.05;

writeControl        timeStep;

writeInterval       10;

purgeWrite          0;

writeFormat         ascii;

writePrecision      12;

writeCompression    off;

timeFormat          general;

timePrecision       8;

libs ("libCoSimIOAdapterFunctionObject.so");
functions
{
    CoSimIO_Adapter
    {
        type CoSimIOAdapterFunctionObject;
        errors strict; // Available since OpenFOAM v2012
    }

    // Function object "CourantNo" to see courant number
    Co1
    {
        type                CourantNo;
        libs                ("libfieldFunctionObjects.so");
        executeControl      timeStep;
        executeInterval     50;
        writeControl        writeTime;
    }

    // Function object "forces" to calcuate the total force on interface
    forces
    {
        type                forces;
        libs                ( "libforces.so" );
        patches             (Mok);
        rho                 rhoInf;
        log                 true;
        rhoInf              956.0;
        CofR                (0 0 0);
        writeControl    timeStep;
        writeInterval   1;
    }

    residuals
    {
        type            residuals;
        libs            ("libutilityFunctionObjects.so");
        writeControl    timeStep;
        writeInterval   100;
        fields          (p U);
    }


    probes
    {
        type            probes;
        libs            ("libsampling.so");

        writeControl    writeTime;     // or timeStep if you want every step
        writeInterval   100;

        fields          (U p);         // add whatever you want to sample

        probeLocations
        (
            (0.4965 0.25 0.0)
        );
    }

    writePointDisplacement
    {
        type            writeObjects;
        libs            ("libutilityFunctionObjects.so");

        writeControl    timeStep;
        writeInterval   100;

        objects         (pointDisplacement);
    }


}

// ************************************************************************* //
