Examples/FSI_Mok/system/blockMeshDict
// // ************************************************************************* //
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}


// ************************************************************************* //

convertToMeters 1;

zf -0.5;
zb 0.5;


// Mesh parameters
// Number of cells
NX1 80; // Inlet
NX2 1;  // Wall
NX3 100; // Ramp
NX4 40; // Curvatura
NX5 30; // Outlet

NY1 40; // Inferior
NY2 10; // Superior

// Grading Mesh
GRX1 0.25; //Inlet
GRX2 1; // Wall
GRX3 3; // Ramp
GRX4 1; // Curve
GRX5 3; // Outlet

GRY1 6; // Superior
GRY2 1; // Inferior

// ************************************************************************* //

vertices
(


// ======================================================
// BLOCK 1
// ======================================================

(0       0       $zf) //0
(0       0.25    $zf) //1
(0.4965  0       $zf) //2
(0.4965  0.25    $zf) //3

(0       0       $zb) //4
(0       0.25    $zb) //5
(0.4965  0       $zb) //6
(0.4965  0.25    $zb) //7



// ======================================================
// BLOCK 2
// ======================================================

(0       0.25    $zf) //8 indentical as 1
(0       0.5     $zf) //9
(0.4965  0.25    $zf) //10 identical as 3
(0.4965  0.5     $zf) //11

(0       0.25    $zb) //12 identical as 5
(0       0.5     $zb) //13
(0.4965  0.25    $zb) //14 Identical as 7
(0.4965  0.5     $zb) //15



// ======================================================
// BLOCK 3 - flexible wall
// ======================================================

(0.4965 0.25 $zf) //16 identical as 3 (and 10)
(0.4965 0.5  $zf) //17 identical as 11
(0.5015 0.25 $zf) //18 
(0.5015 0.5  $zf) //19

(0.4965 0.25 $zb) //20 identical as 7
(0.4965 0.5  $zb) //21 identical as 15
(0.5015 0.25 $zb) //22 
(0.5015 0.5  $zb) //23



// ======================================================
// BLOCK 4 - divergent inferior
// ======================================================

(0.5015 0    $zf) //24
(0.5015 0.25 $zf) //25 identical as 18
(1.17   0.35 $zf) //26 
(1.17   0.25    $zf) //27

(0.5015 0    $zb) //28
(0.5015 0.25 $zb) //29 identical as 22
(1.17   0.35 $zb) //30
(1.17   0.25    $zb) //31



// ======================================================
// BLOCK 5 - divergent superior
// ======================================================

(0.5015 0.25 $zf) //32 identical as 18 (25)
(0.5015 0.5  $zf) //33 identical as 19
(1.17   0.35 $zf) //34 identical as 27
(1.17   0.5  $zf) //35

(0.5015 0.25 $zb) //36 identical as 22 (19)
(0.5015 0.5  $zb) //37 identical as 23
(1.17   0.35 $zb) //38 identical as 31
(1.17   0.5  $zb) //39



// ======================================================
// BLOCK 6 - curvatura inferior
// ======================================================

(1.17 0.25 $zf) //40 identical as 26
(1.17 0.35 $zf) //41 identical as 27 (34)
(1.47 0.3  $zf) //42
(1.47 0.35 $zf) //43

(1.17 0.25 $zb) //44 identical as 30
(1.17 0.35 $zb) //45 identical as 31 (38)
(1.47 0.3  $zb) //46 
(1.47 0.35 $zb) //47



// ======================================================
// BLOCK 7 - superior curvatura
// ======================================================

(1.17 0.35 $zf) //48 identical as 27 (34, 41)
(1.17 0.5  $zf) //49 identical as 35
(1.47 0.35 $zf) //50 identical as 43
(1.47 0.5  $zf) //51

(1.17 0.35 $zb) //52 identical as 31 (38, 45)
(1.17 0.5  $zb) //53 identical as 39
(1.47 0.35 $zb) //54 identical as 47
(1.47 0.5  $zb) //55



// ======================================================
// BLOCK 8 - outlet superior
// ======================================================

(1.47 0.35 $zf) //56 identical as 43 (50)
(1.47 0.5  $zf) //57 identical as 51
(1.75 0.35 $zf) //58 
(1.75 0.5  $zf) //59

(1.47 0.35 $zb) //60 identical as 47 (54)
(1.47 0.5  $zb) //61 identical as 55
(1.75 0.35 $zb) //62 
(1.75 0.5  $zb) //63



// ======================================================
// BLOCK 9 - outlet inferior
// ======================================================

(1.47 0.3 $zf) //64 identical as 42
(1.47 0.35 $zf) //65 identical as 43 (50, 56)
(1.75 0.3 $zf) //66
(1.75 0.35 $zf) //67 identical as 58

(1.47 0.3 $zb) //68 identical as 46
(1.47 0.35 $zb) //69 identical as 47 (54, 60)
(1.75 0.3 $zb) //70
(1.75 0.35 $zb) //71 identical as 62


);



// ************************************************************************* //

blocks
(


hex (0 2 3 1 4 6 7 5) // Inlet inferior
($NX1 $NY1 1)
simpleGrading ($GRX1 $GRY1 1)


hex (1 3 11 9 5 7 15 13) // Inlet superior
($NX1 $NY2 1)
simpleGrading ($GRX1 $GRY2 1)


hex (3 18 19 11 7 22 23 15)
($NX2 $NY2 1)
simpleGrading ($GRX2 $GRY2 1)



// divergent inferior

hex (24 27 26 18 28 31 30 22)
($NX3 $NY1 1)
simpleGrading ($GRX3 $GRY1 1)


// divergent superior

hex (18 26 35 19 22 30 39 23)
($NX3 $NY2 1)
simpleGrading ($GRX3 $GRY2 1)



// curvatura

hex (27 42 43 26 31 46 47 30)
($NX4 $NY1 1)
simpleGrading ($GRX4 $GRY1 1)



// superior curvatura

hex (26 43 51 35 30 47 55 39)
($NX4 $NY2 1)
simpleGrading ($GRX4 $GRY2 1)



// outlet superior

hex (43 58 59 51 47 62 63 55)
($NX5 $NY2 1)
simpleGrading ($GRX5 $GRY2 1)



// outlet inferior

hex (42 66 58 43 46 70 62 47)
($NX5 $NY1 1)
simpleGrading ($GRX5 $GRY1 1)


);



// ************************************************************************* //

edges
(

arc 27 42
(
1.32 0.287 $zf
)


arc 31 46
(
1.32 0.287 $zb
)

);



// ************************************************************************* //

boundary
(


inlet
{
    type patch;

    faces
    (
    (0 4 5 1)
    (1 5 13 9)
    );
}



outlet
{
    type patch;

    faces
    (
    (58 62 63 59)
    (66 70 62 58)
    );
}



bottom
{
    type wall;

    faces
    (
    (0 2 6 4)
    (24 28 31 27)
    (27 31 46 42)
    (42 46 70 66)
    );
}



top
{
    type patch;

    faces
    (
    (9 13 15 11)
    (11 15 23 19)
    (19 23 39 35)
    (35 39 55 51)
    (51 55 63 59)
    );
}



Mok
{
    type wall;

    faces
    (
    (2 6 7 3)
    (3 7 22 18)
    (24 28 22 18)
    );
}



frontAndBack
{
    type empty;

    faces
    (
    (0 2 3 1)
    (4 5 7 6)

    (1 3 11 9)
    (5 13 15 7)

    (3 18 19 11)
    (7 15 23 22)

    (24 27 26 18)
    (28 22 30 31)

    (18 26 35 19)
    (22 23 39 30)

    (27 42 43 26)
    (31 46 47 30)

    (26 43 51 35)
    (30 47 55 39)

    (43 58 59 51)
    (47 62 63 55)

    (42 66 58 43)
    (46 70 62 47)
    );

}

);


mergePatchPairs
(

);