Examples/FSI_Mok/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          50;
        startFace       24679;
    }
    outlet
    {
        type            patch;
        nFaces          50;
        startFace       24729;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          250;
        startFace       24779;
    }
    top
    {
        type            patch;
        nFaces          251;
        startFace       25029;
    }
    Mok
    {
        type            wall;
        inGroups        1(wall);
        nFaces          81;
        startFace       25280;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          25020;
        startFace       25361;
    }
)

// ************************************************************************* //
