Examples/FSI_Mok/system/fvSolution_new
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}

solvers
{
    p
    {
        solver           GAMG;
        tolerance        1e-6;
        relTol           1e-5;
        smoother         DICGaussSeidel;
    }

    pFinal
    {
        $p;
        tolerance        1e-7;
        relTol           0;
    }

    pcorr
    {
        solver           GAMG;
        tolerance        1e-6;
        relTol           1e-5;
        smoother         DICGaussSeidel;
    }

    pcorrFinal
    {
        $pcorr;
        tolerance        1e-7;
        relTol           0;
    }

    phi
    {
        $p;
    }

    "(U|cellDisplacement)"
    {
        solver           smoothSolver;
        smoother         symGaussSeidel;
        tolerance        1e-7;
        relTol           1e-4;
    }

    "(U|cellDisplacement)Final"
    {
        $U;
        tolerance        1e-8;
        relTol           0;
    }
}

PIMPLE
{
    nOuterCorrectors          5;
    nCorrectors               2;
    nNonOrthogonalCorrectors  1;

    correctPhi                yes;
    consistent                true;

    residualControl
    {
        U
        {
            tolerance          1e-5;
            relTol             0;
        }

        p
        {
            tolerance          1e-5;
            relTol             0;
        }
    }
}

PISO
{
    nNonOrthogonalCorrectors 1;
}

potentialFlow
{
    nNonOrthogonalCorrectors 1;
}